# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [3]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [6]:
sql_str = """SELECT e.firstName, e.lastName
             FROM employees e
             INNER JOIN offices o
             USING (officeCode)
             WHERE o.City = 'Boston'
             ORDER BY e.lastName
             ;"""

df = pd.DataFrame(cur.execute(sql_str).fetchall())
df.columns = [x[0] for x in cur.description]

df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [10]:
sql_str = """SELECT o.officeCode
             , o.City
             , COUNT(e.employeeNumber) AS employee_count
             FROM offices o
             LEFT JOIN employees e
             USING (officeCode)
             GROUP BY o.officeCode
             HAVING employee_count = 0
             ;"""

df = pd.DataFrame(cur.execute(sql_str).fetchall())
df.columns = [x[0] for x in cur.description]

df

   officeCode    city  employee_count
0          27  Boston               0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [15]:
sql_str = """SELECT p.productName
             , (e.firstName || ' ' || e.lastname) AS employee_name
             FROM products p
             INNER JOIN orderdetails
                 USING (productCode)
             INNER JOIN orders
                 USING (orderNumber)
             INNER JOIN customers c
                 USING (customerNumber)
             INNER JOIN employees e
                 ON e.employeeNumber = c.salesRepEmployeeNumber
             ORDER BY productName, employee_name
             ;"""

df = pd.DataFrame(cur.execute(sql_str).fetchall())
df.columns = [x[0] for x in cur.description]

df

                              productName    employee_name
0     18th Century Vintage Horse Carriage      Andy Fixter
1     18th Century Vintage Horse Carriage      Andy Fixter
2     18th Century Vintage Horse Carriage      Andy Fixter
3     18th Century Vintage Horse Carriage      Andy Fixter
4     18th Century Vintage Horse Carriage      Barry Jones
...                                   ...              ...
2991            The USS Constitution Ship  Pamela Castillo
2992            The USS Constitution Ship  Pamela Castillo
2993            The USS Constitution Ship      Peter Marsh
2994            The USS Constitution Ship  Steve Patterson
2995            The USS Constitution Ship  Steve Patterson

[2996 rows x 2 columns]

## Level Up: Display the Number of Products each employee has sold

In [17]:
sql_str = """SELECT (e.firstName || ' ' || e.lastname) AS employee_name
             , COUNT(p.productName) as num_products_sold
             FROM products p
             INNER JOIN orderdetails
                 USING (productCode)
             INNER JOIN orders
                 USING (orderNumber)
             INNER JOIN customers c
                 USING (customerNumber)
             INNER JOIN employees e
                 ON e.employeeNumber = c.salesRepEmployeeNumber
             GROUP BY employee_name
             ORDER BY num_products_sold DESC
             ;"""

df = pd.DataFrame(cur.execute(sql_str).fetchall())
df.columns = [x[0] for x in cur.description]

df

       employee_name  num_products_sold
0   Gerard Hernandez                396
1    Leslie Jennings                331
2    Pamela Castillo                272
3         Larry Bott                236
4        Barry Jones                220
5      George Vanauf                211
6        Peter Marsh                185
7        Andy Fixter                185
8        Loui Bondur                177
9    Steve Patterson                152
10    Foon Yue Tseng                142
11        Mami Nishi                137
12    Julie Firrelli                124
13     Martin Gerard                114
14   Leslie Thompson                114

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!